notes/guix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Guix</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://www.haider.gq/base/style.css'/> 
<link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css' /> 
<link rel='preconnect' href='https://fonts.googleapis.com'> 
<link rel='preconnect' href='https://fonts.gstatic.com' crossorigin> 
<link href='https://fonts.googleapis.com/css2?family=Poppins:ital@1&family=Roboto&display=swap' rel='stylesheet'>
<link href='https://fonts.googleapis.com/css2?family=JetBrains+Mono&display=swap' rel='stylesheet'>
<meta name='keywords' content='development, coding, programming, linux, emacs, guix'>
<link rel='icon' type='image/x-icon' href='/base/favicon.png'>
<meta name='description' content="Haider Mirza's website">
</head>
<body>
<div id="preamble" class="status">

<div class='grid-container'>
  <div class='grid-item header'>

    <a href='https://www.haider.gq' class='Header_Title'>
      <span class='Header_Haider-Mirza'>Haider Mirza</span>
    </a>
    <ul class='Header_links'>
      <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
    </ul>

    <form role='search' id='form'>
      <input type='search' id='query' name='q'
	     placeholder='Search...'
	     aria-label='Search through site content'
	     class='Sidebar_Search'>
    </form>
  </div>

  <div class='grid-item main'>
    <form role='search' id='form'>
      <input type='search' id='query' name='q'
	     placeholder='Search...'
	     aria-label='Search through site content'
	     class='Main_Search'>
    </form>
    <script src='https://www.haider.gq/base/search.js' crossorigin='anonymous'></script>
    <div class='main-main'> <!-- The actual main part -->
</div>
<div id="content" class="content">
<h1 class="title">Guix</h1>

<div id="outline-container-orgff7c924" class="outline-2">
<h2 id="orgff7c924">Guix</h2>
<div class="outline-text-2" id="text-orgff7c924">
<p>
The legendary package manager and operating system that geeks use.
</p>
</div>
<div id="outline-container-org346f3d7" class="outline-3">
<h3 id="org346f3d7">Issues</h3>
<div class="outline-text-3" id="text-org346f3d7">
</div>
<div id="outline-container-org991a7e9" class="outline-4">
<h4 id="org991a7e9">Binary - no file or directory</h4>
<div class="outline-text-4" id="text-org991a7e9">
<p>
Turns out the issue is of a binary trying to use a certain interpreter, which Guix does not have.
You can force the binary to use a interpreter with something resembling "patchelf &#x2013;set-interpreter /gnu/store/5h2w4qi9hk1qzzgi1w83220ydslinr4s-glibc-2.33/lib/ld-linux-x86-64.so.2 foo".
You have to install the patchelf package to get this functionality.
Also you can see information on the interpreter and stuff about a binary with "readelf" which is in binutils. I used "readelf -l clangd"
You can also see <a target='_blank' rel='noopener noreferrer' class='external' href="https://issues.guix.gnu.org/54941">https://issues.guix.gnu.org/54941</a> for the bug report I filed (Yes, I did mess up later in the email like always).
</p>
</div>
</div>
<div id="outline-container-orgc343791" class="outline-4">
<h4 id="orgc343791"><a href="virt_manager.html#ID-7baa6460-e5ac-4df5-98f5-0a5a4aeaa0aa">virt-manager</a> doesnt save preferences</h4>
<div class="outline-text-4" id="text-orgc343791">
<p>
You get some dconf errors, I managed to fix this by installing dconf in profile.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf3400cf" class="outline-2">
<h2 id="orgf3400cf">Links to this note</h2>
<div class="outline-text-2" id="text-orgf3400cf">
<ul class="org-ul">
<li><a href="./org_roam.html">Org-roam</a></li>
<li><a href="./flatpak.html">Flatpak</a></li>
<li><a href="./flatpak.html">Flatpak</a></li>
<li><a href="./git.html">Git</a></li>
<li><a href="./glad.html">GLAD</a></li>
<li><a href="./emacs.html">Emacs</a></li>
<li><a href="./org_roam.html">Org-roam</a></li>
<li><a href="./glad.html">GLAD</a></li>
<li><a href="./flatpak.html">Flatpak</a></li>
<li><a href="./flatpak.html">Flatpak</a></li>
<li><a href="./emacs.html">Emacs</a></li>
<li><a href="./git.html">Git</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
</div>
		    </div>
		<div class='grid-item sidebar'>
		  <h2>Socials</h2>
		  <ul class='sidebar-socials'>
		    <li><a href='mailto:haider@haider.gq'><i class='fa-solid fa-envelope'></i> Email</a></li>
		    <li class='irc' onclick='alert('My Username is Haider,
You can find me in Libera.Chat on these channels:
- #tropin 
- #systemcrafters 
- #guix');'><i class='fa-solid fa-message'></i> IRC/Matrix</li>
		    <li><a href='https://www.github.com/Haider-Mirza'><i class='fa-brands fa-github'></i> Github</a></li>
		  </ul>
		  <h2>Projects</h2>
		  <ul class='sidebar-projects'>
		    <li><a href='https://www.github.com/Haider-Mirza/Spinter'> Spinter</a></li>
		  </ul>
		</div>
		<div class='grid-item footer'>
		  <p>Created by Haider Mirza with orgmode in emacs</p>
		</div>
	      </div>
</div>
</body>
</html>
